sprout88/msp430_project/프로젝트_2번/main.c
    }

    if(toggle_lock == 1){ // adc_scaled_sec 로 led를 이미 toggle 중이였다면 종료 후 모터 모드로 전환

    }

    toggle_lock = 1;

}


// left switch dir p1.1
void left_switch_interrupt_handler(void){
    // write your code here
    g_anti_clockwise_pwm = 500;
    g_clockwise_pwm = 0;
}

void keypad_push_handler(unsigned int key){ // 각 case 를 구현하지 않아도 오류 없음. (keypad_input_polling_checker에서 검증함)
    switch(key){
        case 0:
            tmp1=0;
            // input your handler
            break;
        case 1:
            tmp1=1;
            // input your handler
            break;
        case 2:
            tmp1=2;
            // input your handler
            break;
        case 3:
            tmp1=3;
            // input your handler
            break;
        case 4:
            tmp1=4;
            // input your handler
            break;
        case 5:
            tmp1=5;
            // input your handler
            break;
        case 6:
            tmp1=6;
            // input your handler
            break;
        case 7:
            tmp1=7;
            // input your handler
            break;
        case 8:
            tmp1=8;
            // input your handler
            break;
        case 9:
            tmp1=9;
            // input your handler
            break;
        case 10:
            tmp1=10;
            // input your handler
            break;
        case 11: // 11:star
            tmp1+=1;
            break;
        case 12: // 12:sharp
            tmp1=12;
            break;
    }
}
void keypad_release_handler(unsigned int key){ // 각 case 를 구현하지 않아도 오류 없음. (keypad_input_polling_checker에서 검증함)
    switch(key){
        case 0:
            tmp2=0;
            // input your handler
            break;
        case 1:
            tmp2=1;
            // input your handler
            break;
        case 2:
            tmp2=2;
            // input your handler
            break;
        case 3:
            tmp2=3;
            // input your handler
            break;
        case 4:
            tmp2=4;
            // input your handler
            break;
        case 5:
            tmp2=5;
            // input your handler
            break;
        case 6:
            tmp2=6;
            // input your handler
            break;
        case 7:
            tmp2=7;
            // input your handler
            break;
        case 8:
            tmp2=8;
            // input your handler
            break;
        case 9:
            tmp2=9;
            // input your handler
            break;
        case 10:
            tmp2=10;
            // input your handler
            break;
        case 11: // 11:star
            tmp2=11;
            break;
        case 12: // 12:sharp
            break;
    }
}
///////////////////////////////////////

//
// ### non-override functions
void adc_single_read_to_segment(){
    if(adc_single_read_to_segment_lock == 1){
        ADC_single_read(&adc_data); // read adc hardware and save to global_var:adc_data
        adc_data_scale_and_save_to_segment_arr(&adc_data,&screen_arr[0]); // convert adc_data to special scaled formet and save to segment_arr
    }
}
void adc_data_scale_and_save_to_segment_arr(unsigned int* p_adc_data, unsigned int* p_screen_arr){

    // 소수점 변환 수행
    scaled_adc_data = scale_transform(*p_adc_data);

    // 자릿수 분리
    if(scaled_adc_data != 1111){
        unsigned int units = scaled_adc_data/10%10; // xxN.?xx
        unsigned int tenths_place_num = scaled_adc_data%10; // xxx.Nxx

        // edit global screen arr
        p_screen_arr[3] = special_digits[0]; // far left : off
        p_screen_arr[2] = special_digits[0]; // mid left : off
        p_screen_arr[1] = digits[units]+special_digits[1]; // mid right : units.
        p_screen_arr[0] = digits[tenths_place_num]; // far right
    }
}

void stop_watchdog_timer(void){
    WDTCTL = WDTPW | WDTHOLD; // stop watchdog timer
}

void init_left_switch(void){
    P1OUT |= BIT1; // DIR
    P1REN |= BIT1; // pull up resister

    P1IE |= BIT1; // Interrupt Enable
    P1IES |= BIT1; // Interrupt edge select : Falling Edge
    P1IFG &= ~BIT1; // interrupt flag
}

void init_right_switch(void){
    P2OUT |= BIT1; // DIR
    P2REN |= BIT1; // pull up resister

    P2IE |= BIT1; // Interrupt Enable
    P2IES |= BIT1; // Interrupt edge select : Falling Edge
    P2IFG &= ~BIT1; // interrupt flag
}

void init_7_segment(void){
    /* 7 segment Digital Output */
    P3DIR |= 0xffff;
    P3OUT &= 0x0000;
    P4DIR |= 0x000f;
    P4OUT = 0x0F; // segment : XXXX
}

void init_timer0(void){
    /* Timer - Timer0 */
    TA0CCTL0 = CCIE;
    TA0CCR0 = 1000; //1000;
    TA0CTL = TASSEL_2 + MC_1 + TACLR; // SMCLK : 1Mhz / Up mode to CCRO
    /* END Timer - Timer0 */
}

void init_timer_ultrasonic(void){// Timer1
    // Timer - Timer1
    TA1CCTL0 = CCIE;
    TA1CCR0 = 50;    // 50us
    TA1CTL = TASSEL_2 + MC_1 + TACLR; // SMCLK : 1MHz / Up mode to CCR0
}

void show_screen(unsigned int value){
    switch (dynamic_segment_cnt)
    {
    case 0:
        P3OUT = digits[value%10];
        if(p4_7_left_led_on) // segment : XXXO
            P4OUT = 0x8E;
        else
            P4OUT = 0x0E;
        break;
    case 1:
        P3OUT = digits[value/10%10];
        if(p4_7_left_led_on) // segment : XXOX
            P4OUT = 0x8D;
        else
            P4OUT = 0x0D;
        break;
    case 2:
        P3OUT = digits[value/100%10];
        if(p4_7_left_led_on) // segment : XOXX
            P4OUT = 0x8B;
        else
            P4OUT = 0x0B;
        break;
    case 3:
        P3OUT = digits[value/1000%10];
        if(p4_7_left_led_on) // segment : OXXX
            P4OUT = 0x87;
        else
            P4OUT = 0x07;
        break;
    }
}

void show_screen_arr(void){
    if (dynamic_segment_cnt > 3)
            dynamic_segment_cnt = 0; // count 순회

    switch (dynamic_segment_cnt)
    {
    case 0:
        P3OUT = screen_arr[0];
        if(p4_7_left_led_on) // segment : XXXO
            P4OUT = 0x8E;
        else
            P4OUT = 0x0E;
        break;
    case 1:
        P3OUT = screen_arr[1];
        if(p4_7_left_led_on) // segment : XXOX
            P4OUT = 0x8D;
        else
            P4OUT = 0x0D;
        break;
    case 2:
        P3OUT = screen_arr[2];
        if(p4_7_left_led_on) // segment : XOXX
            P4OUT = 0x8B;
        else
            P4OUT = 0x0B;
        break;
    case 3:
        P3OUT = screen_arr[3];
        if(p4_7_left_led_on) // segment : OXXX
            P4OUT = 0x87;
        else
            P4OUT = 0x07;
        break;
    }
}

unsigned int scale_transform(int input) {
    if (input < ADC_MIN || input > ADC_MAX) {
        return 1111; // out of range Error
    }

