sprout88/msp430_project/프로젝트_2번/main.c
    int quotient = 0;
    int dividend = 10 * (input - ADC_MIN);

    while ((dividend - ADC_DELTA_TEN_TIME) >= 0) {
        dividend -= ADC_DELTA_TEN_TIME;
        quotient++;
    }
    return quotient;
}

void init_ADC_single_mode(void){
    P6SEL |= BIT0; // ADC DIR

    /* ADC12 control register set */
    /* sample hold time : 16 adc clock cycles, ADC12 ON */
    ADC12CTL0 = ADC12SHT02 + ADC12ON;

    ADC12CTL1 = ADC12SHP; // sample hold : pulse mode
    ADC12MCTL0 = ADC12INCH_0; // input channel=A0
    ADC12CTL0 |= ADC12ENC; // ADC12 encoding=enable
}

void init_ADC_repeat_single_mode(void){
    P6SEL |= BIT0; // ADC DIR

    /* ADC12 control register set */
    /* sample hold time : 16 adc clock cycles, ADC12 ON */

    ADC12CTL0 = ADC12SHT02 + ADC12MSC + ADC12ON; //ADC REPEAT SINGLE MODE
    ADC12CTL1 = ADC12SHP + ADC12CONSEQ_2; // sample hold : pulse mode, REPEAT SINGLE MODE
    ADC12MCTL0 = ADC12INCH_0; // input channel=A0
    ADC12CTL0 |= ADC12ENC; // ADC12 encoding=enable

    ADC12CTL0 |= ADC12SC; // REPEAT SINGLE MODE
}


void ADC_single_read(unsigned int* p_data){
    ADC12CTL0 |= ADC12SC; // ADC control register set
    while(!(ADC12IFG & BIT0)); // prevent reading previous data
    *p_data = ADC12MEM0; // data save
}

void ADC_repeat_single_read(unsigned int* p_data){
    *p_data = ADC12MEM0;
}

void enable_interrupt_vector(void){
    __bis_SR_register(GIE);
}

void toggle_led_per_time_ms(unsigned int toggle_interval_ms){
    if(toggle_led_per_time_ms_lock==1){
        // toggle two led per time
        if(led_toggle_cnt > toggle_interval_ms ){
            // toggle leds
            if(led_toggle_state){
                turn_on_led(1);
                turn_off_led(2);
                led_toggle_state=0;
            }else{
                turn_off_led(1);
                turn_on_led(2);
                led_toggle_state=1;
            }
            led_toggle_cnt = 0;
        }
    }
}

void init_led(int led_num){
    switch(led_num){
        case 1:
            // LED1 DIR : P1.1
            P1DIR |= BIT0;
            // LED1 OFF
            P1OUT &= ~BIT0;
            break;
        case 2:
            // LED2 DIR : P4.7
            P4DIR |= BIT7;
            // LED2 OFF
            P4OUT &= ~BIT7; // LED2 OFF
    }
}

void turn_on_led(int led_num){
    switch(led_num){
        case 1:
            P1OUT |= BIT0; // LED1 ON
            break;
        case 2:
            P4OUT |= BIT7; // LED2 ON
            p4_7_left_led_on = 1; // p4.7 led and segment pin duplicate error fix
            break;
    }
}
void turn_off_led(int led_num){
    switch(led_num){
        case 1:
            P1OUT &= ~BIT0; // LED1 OFF
            break;
        case 2:
            P4OUT &= ~BIT7; // LED2 OFF
            p4_7_left_led_on = 0; // p4.7 led and segment pin duplicate error fix
            break;
    }
}
void toggle_led(int led_num){
    switch(led_num){
        case 1:
            P1OUT ^= BIT0; // LED1 TOGGLE
        case 2:
            P4OUT ^= BIT7; // LED2 TOGGLE
    }
}

void init_keypad(void){
    // output
    P2DIR |= (BIT0 | BIT2 | BIT3);
    P2OUT |= (BIT0 | BIT2 | BIT3); // all high

    // input
    P6REN |= (BIT3 | BIT4 | BIT5 | BIT6);
    P6OUT |= (BIT3 | BIT4 | BIT5 | BIT6); // pull up
}

// keypad handler
void keypad_input_polling_checker_anticht_by_while(void){ // 꾸욱 누르는 동안 다른 코드가 작동안함(while 문 안에 갇힘)
    // columns 1
    P2OUT &= ~BIT2;
    P2OUT |= (BIT0 | BIT3);

    if ((P6IN & BIT3) == 0) // Button 1
    {
        while(((P6IN & BIT3) == 0)){
            keypad_push_handler(1);
        }
        keypad_release_handler(1);
    }
    else if ((P6IN & BIT6) == 0) // Button 4
    {
        keypad_push_handler(4);
        while(((P6IN & BIT6) == 0)){}
        keypad_release_handler(4);
    }
    else if ((P6IN & BIT5) == 0) // Button 7
    {
        keypad_push_handler(7);
        while(((P6IN & BIT5) == 0)){}
        keypad_release_handler(7);
    }
    else if ((P6IN & BIT4) == 0) // Button *
    {
        keypad_push_handler(11);
        while(((P6IN & BIT4) == 0)){}
        keypad_release_handler(11); //11:*
    }

    // columns 2
    P2OUT &= ~BIT0;
    P2OUT |= (BIT2 | BIT3);

    if ((P6IN & BIT3) == 0) // Button 2
    {
        while(((P6IN & BIT3) == 0)){
            keypad_push_handler(2);
        }
        keypad_release_handler(2);
    }
    else if ((P6IN & BIT6) == 0) // Button 5
    {
        keypad_push_handler(5);
        while(((P6IN & BIT6) == 0)){}
        keypad_release_handler(5);
    }
    else if ((P6IN & BIT5) == 0) // Button 8
    {
        keypad_push_handler(8);
        while(((P6IN & BIT5) == 0)){}
        keypad_release_handler(8);
    }
    else if ((P6IN & BIT4) == 0) // Button 0
    {
        keypad_push_handler(0);
        while(((P6IN & BIT4) == 0)){}
        keypad_release_handler(0);
    }

    // columns 3
    P2OUT &= ~BIT3;
    P2OUT |= (BIT0 | BIT2);

    if ((P6IN & BIT3) == 0) // Button 3
    {
        while(((P6IN & BIT3) == 0)){
            keypad_push_handler(3);
        }
        keypad_release_handler(3);
    }
    else if ((P6IN & BIT6) == 0) // Button 6
    {
        keypad_push_handler(6);
        while(((P6IN & BIT6) == 0)){}
        keypad_release_handler(6);
    }
    else if ((P6IN & BIT5) == 0) // Button 9
    {
        keypad_push_handler(9);
        while(((P6IN & BIT5) == 0)){}
        keypad_release_handler(9);
    }
    else if ((P6IN & BIT4) == 0) // Button #
    {
        keypad_push_handler(12);
        while(((P6IN & BIT4) == 0)){}
        keypad_release_handler(12); // 12:sharp

    }
}
void keypad_input_polling_checker_anticht_by_lock(char* p_pushed_lock_arr) {
    // Columns 1
    P2OUT &= ~BIT2;
    P2OUT |= (BIT0 | BIT3);

    if ((P6IN & BIT3) == 0 && p_pushed_lock_arr[1] == 0) { // Button 1
        keypad_push_handler(1);
        p_pushed_lock_arr[1] = 1; // Lock the button
    } else if ((P6IN & BIT3) != 0 && p_pushed_lock_arr[1] == 1) {
        keypad_release_handler(1);
        p_pushed_lock_arr[1] = 0; // Unlock the button
    }

    if ((P6IN & BIT6) == 0 && p_pushed_lock_arr[4] == 0) { // Button 4
        keypad_push_handler(4);
        p_pushed_lock_arr[4] = 1; // Lock the button
    } else if ((P6IN & BIT6) != 0 && p_pushed_lock_arr[4] == 1) {
        keypad_release_handler(4);
        p_pushed_lock_arr[4] = 0; // Unlock the button
    }

    if ((P6IN & BIT5) == 0 && p_pushed_lock_arr[7] == 0) { // Button 7
        keypad_push_handler(7);
        p_pushed_lock_arr[7] = 1; // Lock the button
    } else if ((P6IN & BIT5) != 0 && p_pushed_lock_arr[7] == 1) {
        keypad_release_handler(7);
        p_pushed_lock_arr[7] = 0; // Unlock the button
    }

    if ((P6IN & BIT4) == 0 && p_pushed_lock_arr[11] == 0) { // Button *
        keypad_push_handler(11);
        p_pushed_lock_arr[11] = 1; // Lock the button
    } else if ((P6IN & BIT4) != 0 && p_pushed_lock_arr[11] == 1) {
        keypad_release_handler(11);
        p_pushed_lock_arr[11] = 0; // Unlock the button
    }

    // Columns 2
    P2OUT &= ~BIT0;
    P2OUT |= (BIT2 | BIT3);

    if ((P6IN & BIT3) == 0 && p_pushed_lock_arr[2] == 0) { // Button 2
        keypad_push_handler(2);
        p_pushed_lock_arr[2] = 1; // Lock the button
    } else if ((P6IN & BIT3) != 0 && p_pushed_lock_arr[2] == 1) {
        keypad_release_handler(2);
        p_pushed_lock_arr[2] = 0; // Unlock the button
    }

    if ((P6IN & BIT6) == 0 && p_pushed_lock_arr[5] == 0) { // Button 5
        keypad_push_handler(5);
        p_pushed_lock_arr[5] = 1; // Lock the button
    } else if ((P6IN & BIT6) != 0 && p_pushed_lock_arr[5] == 1) {
        keypad_release_handler(5);
        p_pushed_lock_arr[5] = 0; // Unlock the button
    }

