sprout88/msp430_project/프로젝트_2번/main.c
    /* lock counters */
    // enable(1) 되었을때만 카운트.
    if(motor_cnt_7_lock==1)
        motor_cnt_7++; // 1++ per 1ms, iterate

    /* cooldowns */
    // 외부에서 cooldown 값으로 변하고, 0으로 바꾸기 위해 count 함
    if(motor_ms_cooldown!=0){
        motor_ms_cooldown--;
    }
}

// right switch interrupt
#pragma vector=PORT2_VECTOR
__interrupt void Port_2(void)
{
    if((P2IN & BIT1) == 0)
    {
        is_right_switch = 1;
        right_switch_interrupt_handler();
    }
    P2IFG &= ~BIT1; // IFG clear (Interrupt END)
}


#pragma vector=PORT1_VECTOR
// left switch interrupt
__interrupt void Port_1(void)
{
    if((P1IN & BIT1) == 0)
    {
        is_left_switch = 1;
        left_switch_interrupt_handler();
    }
    P1IFG &= ~BIT1; // IFG clear (Interrupt END)

// Ultrasonic Sensor Interrupt
    if (P1IFG & BIT4) {
        if ((P1IES & BIT4) == 0) { // if rising edge
            g_ultrasonic_sec = 0;
            // TACCTL1 |= TACLR;
            P1IES |= BIT4; // falling edge
        } else if (P1IES & BIT4) { // if falling edge
            if (g_ultrasonic_sec > 3 && g_ultrasonic_sec < 500) { // 150us ~ 25ms
                g_ultrasonic_data = g_ultrasonic_sec * 50 / 58; // data = g_ultrasonic_sec * 50 / 58;
            } else if (g_ultrasonic_sec >= 760) {
                g_ultrasonic_data = 9999;
            }
            g_ultrasonic_sec = 0;
            P1IES &= ~BIT4; // rising edge
        }
        g_ultrasonic_flag = 0;
        P1IFG &= ~BIT4; // IFG is cleared
    }
}

// Timer1 : Ultrasonic Timer
#pragma vector=TIMER1_A0_VECTOR
__interrupt void TIMER1_A0_ISR(void) {
    g_ultrasonic_sec++;
    if (g_ultrasonic_flag == 1 && g_ultrasonic_sec > 1000) {
        g_ultrasonic_flag = 0;
    }
}
